# Advanced Querying Mongo

**⚠️ IMPORTANT: Limit your print to avoid infinite scrolling. Otherwise your
code will be lost between print lines. If working with lists do:**

```python
list(collection.find(query))[:5] #or a reasonably low number
```

Importing libraries and setting up connection

In [23]:
from pymongo import MongoClient
import time
import pandas as pd

In [3]:
client = MongoClient("mongodb://localhost:27017")

db = client["Ironhack"]
c = db.get_collection ("companies")
c.find_one()

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [10]:
list(c.find({"name":"Babelgum"}, projection = {"_id":0, "name":1, "outcode":1}))[0]

{'name': 'Babelgum'}

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [36]:
filter_1 = { }  
projection = {"name": 20, "number_of_employees": 20,"_id":0} 
results = list(c.find(filter_1, projection).sort("number_of_employees", -1).limit(20))
pd.DataFrame(results)

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                 Bertelsmann               100000
19                                     Comcast               100000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [35]:
filter_2 = {"founded_year": {"$gte": 2000, "$lte":2005}}  
projection = {"name": 1, "founded_year": 1,"_id":0} 
results = list(c.find(filter_2, projection).sort("founded_year", -1))
pd.DataFrame(results)

                 name  founded_year
0            Wetpaint          2005
1                Zoho          2005
2           Omnidrive          2005
3               Helio          2005
4     Jingle Networks          2005
...               ...           ...
3729          Vigilos          2000
3730     Block Shield          2000
3731          Netrake          2000
3732   EnterSys Group          2000
3733        EnteGreat          2000

[3734 rows x 2 columns]

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [59]:
filter_2 = {"ipo.valuation_amount": {"$gte": 100000000}, "founded_year":{"$lte":2010}}  
projection = {"name": 1, "ipo.valuation_amount": 1,"_id":0} 
results = list(c.find(filter_2, projection).sort("ipo.valuation_amount",1))
pd.DataFrame(results)

                    name                                   ipo
0             Salesforce       {'valuation_amount': 110000000}
1                Geeknet       {'valuation_amount': 134000000}
2             QuinStreet       {'valuation_amount': 140000000}
3                  Tudou       {'valuation_amount': 174000000}
4            KIT digital       {'valuation_amount': 235000000}
5              DemandTec       {'valuation_amount': 245000000}
6         ChannelAdvisor       {'valuation_amount': 287000000}
7             Brightcove       {'valuation_amount': 290000000}
8         Rally Software       {'valuation_amount': 315000000}
9                Telenav       {'valuation_amount': 337000000}
10            Shutterfly       {'valuation_amount': 350000000}
11               Opsware       {'valuation_amount': 450000000}
12               Marketo       {'valuation_amount': 465000000}
13                   Wix       {'valuation_amount': 750000000}
14            SolarWinds       {'valuation_amount': 803000000}
15              Infoblox       {'valuation_amount': 824000000}
16  Cornerstone OnDemand       {'valuation_amount': 900000000}
17                  Mixi       {'valuation_amount': 970000000}
18      Millennial Media       {'valuation_amount': 973500000}
19         Jive Software      {'valuation_amount': 1000000000}
20   BrightSource Energy      {'valuation_amount': 1000000000}
21              QlikTech      {'valuation_amount': 1000000000}
22             OpenTable      {'valuation_amount': 1050000000}
23            Higher One      {'valuation_amount': 1060000000}
24                 Chegg      {'valuation_amount': 1100000000}
25                 Chegg      {'valuation_amount': 1100000000}
26                  Yelp      {'valuation_amount': 1300000000}
27               Nielsen      {'valuation_amount': 1600000000}
28                Zillow    {'valuation_amount': 2550000000.0}
29              HomeAway    {'valuation_amount': 3000000000.0}
30           TripAdvisor    {'valuation_amount': 3273770000.0}
31                 Baidu    {'valuation_amount': 4000000000.0}
32             Rackspace    {'valuation_amount': 5440000000.0}
33          BMC Software    {'valuation_amount': 6000000000.0}
34              LinkedIn    {'valuation_amount': 9310000000.0}
35       Western Digital    {'valuation_amount': 9430000000.0}
36               Tencent   {'valuation_amount': 11000000000.0}
37               Groupon   {'valuation_amount': 12800000000.0}
38               Twitter   {'valuation_amount': 18100000000.0}
39                Amazon  {'valuation_amount': 100000000000.0}
40              Facebook  {'valuation_amount': 104000000000.0}
41                  GREE  {'valuation_amount': 108960000000.0}

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [64]:
filter_3 = {"number_of_employees": {"$lte": 1000}, "founded_year":{"$lte":2005}}  
projection = {"name": 1, "number_of_employees": 1,"founded_year": 1,"_id":0} 
results = list(c.find(filter_3, projection).sort("number_of_employees",-1).limit(10))
pd.DataFrame(results)

                         name  number_of_employees  founded_year
0              Sonus Networks                 1000          1997
1  SK Net Service Company Ltd                 1000          2001
2                     Gumtree                 1000          2005
3         Akamai Technologies                 1000          1998
4                    Omniture                 1000          1996
5         Antal International                 1000          1993
6                    OC'LIANE                 1000          2003
7      FANUC Robotics America                 1000          1982
8                     Telenav                 1000          1999
9                       Yodle                 1000          2005

### 6. All the companies that don't include the `partners` field.

In [66]:
filter_4 = {"companies": {"$ne":"partners"}}  
projection = {"name": 1,"_id":0,"partners": 1} 
results = list(c.find(filter_3, projection).sort("name",-1).limit(10))
pd.DataFrame(results)

               name partners
0        zyntroPICS       []
1  zebraspot design       []
2             zanox       []
3            zSlide       []
4             xkoto       []
5      worldtvradio       []
6           webwork       []
7  viastore systems       []
8            vexcom       []
9             vLinx       []

### 7. All the companies that have a null type of value on the `category_code` field.

In [70]:
filter_5 = {"category_code": {"$type": "null"}}  
projection = {"name": 1,"_id":0,"category_code": 1} 
results = list(c.find(filter_5, projection).sort("companies",-1).limit(10))
pd.DataFrame(results)

            name category_code
0         MMDAYS          None
1   Inside Group          None
2        VidKing          None
3  Touch Clarity          None
4          Drigg          None
5   Level9 Media          None
6        Snimmer          None
7     Collective          None
8         KoolIM          None
9      SpaceTime          None

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [73]:
filter_6 = {"number_of_employees": {"$gte": 100, "$lt":1000}}  
projection = {"name": 1,"_id":0,"number_of_employees": 1} 
results = list(c.find(filter_6, projection).sort("number_of_employees",-1).limit(10))
pd.DataFrame(results)

                              name  number_of_employees
0                      Datamonitor                  984
1             Infinera Corporation                  974
2                              Box                  950
3  NorthPoint Communications Group                  948
4                     888 Holdings                  931
5               Forrester Research                  903
6                        SonicWALL                  900
7          Relax Solutions Pvt Ltd                  900
8                       Webmetrics                  900
9                           InMobi                  900

### 9. Order all the companies by their IPO price in a descending order.

In [76]:
filter_6 = { }
projection = {"name": 1,"_id":0,"ipo.valuation_amount": 1} 
results = list(c.find(filter_6, projection).sort("ipo.valuation_amount",-1).limit(10))
pd.DataFrame(results)

              name                                   ipo
0             GREE  {'valuation_amount': 108960000000.0}
1         Facebook  {'valuation_amount': 104000000000.0}
2           Amazon  {'valuation_amount': 100000000000.0}
3          Twitter   {'valuation_amount': 18100000000.0}
4          Groupon   {'valuation_amount': 12800000000.0}
5          Tencent   {'valuation_amount': 11000000000.0}
6  Western Digital    {'valuation_amount': 9430000000.0}
7         LinkedIn    {'valuation_amount': 9310000000.0}
8     BMC Software    {'valuation_amount': 6000000000.0}
9        Rackspace    {'valuation_amount': 5440000000.0}

In [83]:
c.find_one()

{'_id': ObjectId('52cdef7c4bab8bd675297d8a'),
 'name': 'Wetpaint',
 'permalink': 'abc2',
 'crunchbase_url': 'http://www.crunchbase.com/company/wetpaint',
 'homepage_url': 'http://wetpaint-inc.com',
 'blog_url': 'http://digitalquarters.net/',
 'blog_feed_url': 'http://digitalquarters.net/feed/',
 'twitter_username': 'BachelrWetpaint',
 'category_code': 'web',
 'number_of_employees': 47,
 'founded_year': 2005,
 'founded_month': 10,
 'founded_day': 17,
 'deadpooled_year': 1,
 'tag_list': 'wiki, seattle, elowitz, media-industry, media-platform, social-distribution-system',
 'alias_list': '',
 'email_address': 'info@wetpaint.com',
 'phone_number': '206.859.6300',
 'description': 'Technology Platform Company',
 'created_at': datetime.datetime(2007, 5, 25, 6, 51, 27),
 'updated_at': 'Sun Dec 08 07:15:44 UTC 2013',
 'overview': '<p>Wetpaint is a technology platform company that uses its proprietary state-of-the-art technology and expertise in social media to build and monetize audiences for digital publishers. Wetpaint’s own online property, Wetpaint Entertainment, an entertainment news site that attracts more than 12 million unique visitors monthly and has over 2 million Facebook fans, is a proof point to the company’s success in building and engaging audiences. Media companies can license Wetpaint’s platform which includes a dynamic playbook tailored to their individual needs and comprehensive training. Founded by Internet pioneer Ben Elowitz, and with offices in New York and Seattle, Wetpaint is backed by Accel Partners, the investors behind Facebook.</p>',
 'image': {'available_sizes': [[[150, 75],
    'assets/images/resized/0000/3604/3604v14-max-150x150.jpg'],
   [[250, 125], 'assets/images/resized/0000/3604/3604v14-max-250x250.jpg'],
   [[450, 225], 'assets/images/resized/0000/3604/3604v14-max-450x450.jpg']]},
 'products': [{'name': 'Wikison Wetpaint', 'permalink': 'wetpaint-wiki'},
  {'name': 'Wetpaint Social Distribution System',
   'permalink': 'wetpaint-social-distribution-system'}],
 'relationships': [{'is_past': False,
   'title': 'Co-Founder and VP, Social and Audience Development',
   'person': {'first_name': 'Michael',
    'last_name': 'Howell',
    'permalink': 'michael-howell'}},
  {'is_past': False,
   'title': 'Co-Founder/CEO/Board of Directors',
   'person': {'first_name': 'Ben',
    'last_name': 'Elowitz',
    'permalink': 'ben-elowitz'}},
  {'is_past': False,
   'title': 'COO/Board of Directors',
   'person': {'first_name': 'Rob',
    'last_name': 'Grady',
    'permalink': 'rob-grady'}},
  {'is_past': False,
   'title': 'SVP, Strategy and Business Development',
   'person': {'first_name': 'Chris',
    'last_name': 'Kollas',
    'permalink': 'chris-kollas'}},
  {'is_past': False,
   'title': 'Board',
   'person': {'first_name': 'Theresia',
    'last_name': 'Ranzetta',
    'permalink': 'theresia-ranzetta'}},
  {'is_past': False,
   'title': 'Board Member',
   'person': {'first_name': 'Gus',
    'last_name': 'Tai',
    'permalink': 'gus-tai'}},
  {'is_past': False,
   'title': 'Board',
   'person': {'first_name': 'Len',
    'last_name': 'Jordan',
    'permalink': 'len-jordan'}},
  {'is_past': False,
   'title': 'Head of Technology and Product',
   'person': {'first_name': 'Alex',
    'last_name': 'Weinstein',
    'permalink': 'alex-weinstein'}},
  {'is_past': True,
   'title': 'CFO',
   'person': {'first_name': 'Bert',
    'last_name': 'Hogue',
    'permalink': 'bert-hogue'}},
  {'is_past': True,
   'title': 'CFO/ CRO',
   'person': {'first_name': 'Brian',
    'last_name': 'Watkins',
    'permalink': 'brian-watkins'}},
  {'is_past': True,
   'title': 'Senior Vice President, Marketing',
   'person': {'first_name': 'Rob',
    'last_name': 'Grady',
    'permalink': 'rob-grady'}},
  {'is_past': True,
   'title': 'VP, Technology and Product',
   'person': {'first_name': 'Werner',
    'last_name': 'Koepf',
    'permalink': 'werner-koepf'}},
  {'is_past': True,
   'title': 'VP Marketing',
   'person': {'first_name': 'Kevin',
    'last_name': 'Flaherty',
    'permalink': 'kevin-flaherty'}},
  {'is_past': True,
   'title': 'VP User Experience',
   'person': {'first_name': 'Alex',
    'last_name': 'Berg',
    'permalink': 'alex-berg'}},
  {'is_past': True,
   'title': 'VP Engineering',
   'person': {'first_name': 'Steve',
    'last_name': 'McQuade',
    'permalink': 'steve-mcquade'}},
  {'is_past': True,
   'title': 'Executive Editor',
   'person': {'first_name': 'Susan',
    'last_name': 'Mulcahy',
    'permalink': 'susan-mulcahy'}},
  {'is_past': True,
   'title': 'VP Business Development',
   'person': {'first_name': 'Chris',
    'last_name': 'Kollas',
    'permalink': 'chris-kollas'}}],
 'competitions': [{'competitor': {'name': 'Wikia', 'permalink': 'wikia'}},
  {'competitor': {'name': 'JotSpot', 'permalink': 'jotspot'}},
  {'competitor': {'name': 'Socialtext', 'permalink': 'socialtext'}},
  {'competitor': {'name': 'Ning by Glam Media', 'permalink': 'ning'}},
  {'competitor': {'name': 'Soceeo', 'permalink': 'soceeo'}},
  {'competitor': {'name': 'Yola', 'permalink': 'yola'}},
  {'competitor': {'name': 'SocialGO', 'permalink': 'socialgo'}},
  {'competitor': {'name': 'IslamNor', 'permalink': 'islamnor'}}],
 'providerships': [],
 'total_money_raised': '$39.8M',
 'funding_rounds': [{'id': 888,
   'round_code': 'a',
   'source_url': 'http://seattlepi.nwsource.com/business/246734_wiki02.html',
   'source_description': '',
   'raised_amount': 5250000,
   'raised_currency_code': 'USD',
   'funded_year': 2005,
   'funded_month': 10,
   'funded_day': 1,
   'investments': [{'company': None,
     'financial_org': {'name': 'Frazier Technology Ventures',
      'permalink': 'frazier-technology-ventures'},
     'person': None},
    {'company': None,
     'financial_org': {'name': 'Trinity Ventures',
      'permalink': 'trinity-ventures'},
     'person': None}]},
  {'id': 889,
   'round_code': 'b',
   'source_url': 'http://pulse2.com/2007/01/09/wiki-builder-website-wetpaint-welcomes-95m-funding/',
   'source_description': '',
   'raised_amount': 9500000,
   'raised_currency_code': 'USD',
   'funded_year': 2007,
   'funded_month': 1,
   'funded_day': 1,
   'investments': [{'company': None,
     'financial_org': {'name': 'Accel Partners',
      'permalink': 'accel-partners'},
     'person': None},
    {'company': None,
     'financial_org': {'name': 'Frazier Technology Ventures',
      'permalink': 'frazier-technology-ventures'},
     'person': None},
    {'company': None,
     'financial_org': {'name': 'Trinity Ventures',
      'permalink': 'trinity-ventures'},
     'person': None}]},
  {'id': 2312,
   'round_code': 'c',
   'source_url': 'http://www.accel.com/news/news_one_up.php?news_id=185',
   'source_description': 'Accel',
   'raised_amount': 25000000,
   'raised_currency_code': 'USD',
   'funded_year': 2008,
   'funded_month': 5,
   'funded_day': 19,
   'investments': [{'company': None,
     'financial_org': {'name': 'DAG Ventures', 'permalink': 'dag-ventures'},
     'person': None},
    {'company': None,
     'financial_org': {'name': 'Accel Partners',
      'permalink': 'accel-partners'},
     'person': None},
    {'company': None,
     'financial_org': {'name': 'Trinity Ventures',
      'permalink': 'trinity-ventures'},
     'person': None},
    {'company': None,
     'financial_org': {'name': 'Frazier Technology Ventures',
      'permalink': 'frazier-technology-ventures'},
     'person': None}]}],
 'investments': [],
 'acquisition': {'price_amount': 30000000,
  'price_currency_code': 'USD',
  'term_code': 'cash_and_stock',
  'source_url': 'http://allthingsd.com/20131216/viggle-tries-to-bulk-up-its-social-tv-business-by-buying-wetpaint/?mod=atdtweet',
  'source_description': ' Viggle Tries to Bulk Up Its Social TV Business by Buying Wetpaint',
  'acquired_year': 2013,
  'acquired_month': 12,
  'acquired_day': 16,
  'acquiring_company': {'name': 'Viggle', 'permalink': 'viggle'}},
 'acquisitions': [],
 'offices': [{'description': '',
   'address1': '710 - 2nd Avenue',
   'address2': 'Suite 1100',
   'zip_code': '98104',
   'city': 'Seattle',
   'state_code': 'WA',
   'country_code': 'USA',
   'latitude': 47.603122,
   'longitude': -122.333253},
  {'description': '',
   'address1': '270 Lafayette Street',
   'address2': 'Suite 505',
   'zip_code': '10012',
   'city': 'New York',
   'state_code': 'NY',
   'country_code': 'USA',
   'latitude': 40.7237306,
   'longitude': -73.9964312}],
 'milestones': [{'id': 5869,
   'description': "Wetpaint named in Lead411's Hottest Seattle Companies list",
   'stoned_year': 2010,
   'stoned_month': 6,
   'stoned_day': 8,
   'source_url': 'http://www.lead411.com/seattle-companies.html',
   'source_text': None,
   'source_description': 'LEAD411 LAUNCHES "HOTTEST SEATTLE COMPANIES" AWARDS',
   'stoneable_type': 'Company',
   'stoned_value': None,
   'stoned_value_type': None,
   'stoned_acquirer': None,
   'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}},
  {'id': 8702,
   'description': 'Site-Builder Wetpaint Makes One For Itself, Using the Demand Media Playbook',
   'stoned_year': 2010,
   'stoned_month': 9,
   'stoned_day': 6,
   'source_url': 'http://mediamemo.allthingsd.com/20100906/site-builder-wetpaint-makes-one-for-itself-using-the-demand-media-playbook/',
   'source_text': None,
   'source_description': 'All Things D',
   'stoneable_type': 'Company',
   'stoned_value': None,
   'stoned_value_type': None,
   'stoned_acquirer': None,
   'stoneable': {'name': 'Wetpaint', 'permalink': 'wetpaint'}}],
 'video_embeds': [],
 'screenshots': [{'available_sizes': [[[150, 86],
     'assets/images/resized/0016/0929/160929v2-max-150x150.png'],
    [[250, 143], 'assets/images/resized/0016/0929/160929v2-max-250x250.png'],
    [[450, 258], 'assets/images/resized/0016/0929/160929v2-max-450x450.png']],
   'attribution': None}],
 'external_links': [{'external_url': 'http://www.geekwire.com/2011/rewind-ben-elowitz-wetpaint-ceo-building-type-media-company',
   'title': 'GeekWire interview: Rewind - Ben Elowitz, Wetpaint CEO, on building a new type of media company'},
  {'external_url': 'http://techcrunch.com/2012/06/17/search-and-social-how-two-will-soon-become-one/',
   'title': 'Guest post by CEO Ben Elowitz in TechCrunch'},
  {'external_url': 'http://allthingsd.com/20120516/what-to-expect-when-facebook-is-expecting-five-predictions-for-facebooks-first-public-year/',
   'title': 'Guest post by CEO Ben Elowitz in AllThingsD'},
  {'external_url': 'http://adage.com/article/digitalnext/facebook-biggest-player-advertising-s-540-billion-world/235708/',
   'title': 'Guest post by CEO Ben Elowitz in AdAge'},
  {'external_url': 'http://www.businessinsider.com/facebook-captures-14-percent-of-our-online-attention-but-only-4-percent-of-ad-spending-online-2012-6',
   'title': 'Guest post by CEO Ben Elowitz in Business Insider'},
  {'external_url': 'http://allfacebook.com/wetpaint-media-data_b75963',
   'title': 'AllFacebook coverage of Wetpaint'},
  {'external_url': 'http://adage.com/article/digital/celeb-site-wetpaint-shows-media-profit-facebook/237828/',
   'title': 'Profile of Wetpaint in Ad Age'},
  {'external_url': 'http://allthingsd.com/20121018/how-to-boost-your-facebook-traffic-tips-and-tricks-from-wetpaint/',
   'title': 'Interview with Wetpaint CEO Ben Elowitz in All Things D'},
  {'external_url': 'http://www.xconomy.com/seattle/2012/10/19/wetpaint-starts-licensing-its-facebook-based-media-distribution-tech/',
   'title': 'Profile of Wetpaint in Xconomy'}],
 'partners': []}

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [78]:
filter_7 = { }
projection = {"name": 1,"_id":0,"number_of_employees": 1} 
results = list(c.find(filter_7, projection).sort("number_of_employees",-1).limit(10))
pd.DataFrame(results)

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [80]:
filter_7 = {"founded_month": {"$gt":6}}
projection = {"name": 1,"_id":0,"founded_month": 1} 
results = list(c.find(filter_7, projection).sort("founded_month",-1).limit(1000))
pd.DataFrame(results)

                           name  founded_month
0                      Glogster             12
1                    Microworks             12
2                  Claremontian             12
3                   Vivity Labs             12
4                         Gengo             12
..                          ...            ...
995              Why Hasn't He?             10
996                      Fresho             10
997                      Driftr             10
998        Radha Krishna Portal             10
999  Berkeley Design Automation             10

[1000 rows x 2 columns]

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.000

In [87]:
filter_7 = {"founded_year": {"$lte":2000}, "acquisition.price_amount":{"$gte":10000000}}
projection = {"name": 1,"_id":0,"acquisition.price_amount": 1, "founded_year": 1} 
results = list(c.find(filter_7, projection).sort("acquisition.price_amount",-1).limit(10))
pd.DataFrame(results)

                           name  founded_year                     acquisition
0                   BEA Systems          1995  {'price_amount': 8500000000.0}
1                        Navteq          1985  {'price_amount': 8100000000.0}
2              Sun Microsystems          1982  {'price_amount': 7400000000.0}
3                         Pixar          1986  {'price_amount': 7400000000.0}
4                           LSI          1980  {'price_amount': 6600000000.0}
5        National Semiconductor          1959  {'price_amount': 6500000000.0}
6                     aQuantive          1997  {'price_amount': 6400000000.0}
7                Siebel Systems          1993  {'price_amount': 5850000000.0}
8                        Sybase          1984  {'price_amount': 5800000000.0}
9  Affiliated Computer Services          1988  {'price_amount': 5750000000.0}

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [89]:
filter_8 = {"acquisition.acquired_year": {"$gte":2010}}
projection = {"name": 1,"_id":0,"acquisition.acquired_year": 1,"acquisition.price_amount": 1} 
results = list(c.find(filter_8, projection).sort("acquisition.price_amount",-1).limit(10))
pd.DataFrame(results)

                     name                                        acquisition
0                T-Mobile  {'price_amount': 39000000000.0, 'acquired_year...
1    Goodrich Corporation  {'price_amount': 18400000000.0, 'acquired_year...
2                     LSI  {'price_amount': 6600000000.0, 'acquired_year'...
3  National Semiconductor  {'price_amount': 6500000000.0, 'acquired_year'...
4                  Sybase  {'price_amount': 5800000000.0, 'acquired_year'...
5                   Ariba  {'price_amount': 4300000000.0, 'acquired_year'...
6   NetLogic Microsystems  {'price_amount': 3700000000.0, 'acquired_year'...
7        Interactive Data  {'price_amount': 3400000000.0, 'acquired_year'...
8          SuccessFactors  {'price_amount': 3400000000.0, 'acquired_year'...
9        Qualcomm Atheros  {'price_amount': 3100000000.0, 'acquired_year'...

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [90]:
filter_9 = {}
projection = {"name": 1,"_id":0,"founded_year": 1} 
results = list(c.find(filter_9, projection).sort("founded_year",-1).limit(10))
pd.DataFrame(results)

        name  founded_year
0      Wamba          2013
1     Gimigo          2013
2     Clowdy          2013
3      Fixya          2013
4       Fluc          2013
5   SEOGroup          2013
6       Pikk          2013
7   WhosCall          2013
8     iBazar          2013
9  Advaliant          2013

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [92]:
filter_10 = {"founded_day" : {"$lte":7}}
projection = {"name": 1,"_id":0,"founded_day": 1} 
results = list(c.find(filter_10, projection).sort("founded_day",-1))
pd.DataFrame(results)

               name  founded_day
0            Meetup            7
1            Google            7
2     Jive Software            7
3           Rakuten            7
4            Driftr            7
...             ...          ...
3216       Gambolio            1
3217       SEO Sumo            1
3218   Kicker Films            1
3219         Getyoo            1
3220       cotralis            1

[3221 rows x 2 columns]

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [98]:
filter_10 = {"category_code":"web","number_of_employees" : {"$gte":4000}}
projection = {"name": 1,"_id":0,"category_code": 1, "number_of_employees":1} 
results = list(c.find(filter_10, projection).sort("number_of_employees",1))
pd.DataFrame(results)

                            name category_code  number_of_employees
0                        Expedia           web                 4400
1                            AOL           web                 8000
2                        Webkinz           web                 8657
3                        Rakuten           web                10000
4  Los Angeles Times Media Group           web                10000
5                        Groupon           web                10000
6                         Yahoo!           web                13600
7                           eBay           web                15000
8                       Experian           web                15500

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [102]:
filter_11 = {"acquisition.price_currency_code":"EUR","acquisition.price_amount" : {"$gte":10000000}}
projection = {"name": 1,"_id":0,"acquisition.price_amount":1, "acquisition.price_currency_code":1} 
results = list(c.find(filter_11, projection).sort("acquisition.price_amount",-1))
pd.DataFrame(results)

                  name                                        acquisition
0              Apertio  {'price_amount': 140000000, 'price_currency_co...
1              Webedia  {'price_amount': 70000000, 'price_currency_cod...
2  Tuenti Technologies  {'price_amount': 70000000, 'price_currency_cod...
3       BioMed Central  {'price_amount': 43400000, 'price_currency_cod...
4    Greenfield Online  {'price_amount': 40000000, 'price_currency_cod...
5                  ZYB  {'price_amount': 31500000, 'price_currency_cod...
6            Wayfinder  {'price_amount': 24000000, 'price_currency_cod...

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [104]:
filter_12 = {"acquisition.acquired_month":{"$lte":3}}
projection = {"name": 1,"_id":0,"acquisition":1} 
results = list(c.find(filter_12, projection).sort("acquisition",-1).limit(10))
results

[{'name': 'T-Mobile',
  'acquisition': {'price_amount': 39000000000.0,
   'price_currency_code': 'USD',
   'term_code': None,
   'source_url': 'http://techcrunch.com/2011/03/20/in-the-race-for-more-spectrum-att-is-acquiring-t-mobile-for-39-billion/',
   'source_description': 'In The Race For More Spectrum, AT&T Is Acquiring T-Mobile For $39 Billion',
   'acquired_year': 2011,
   'acquired_month': 3,
   'acquired_day': 20,
   'acquiring_company': {'name': 'AT&T', 'permalink': 'at-t'}}},
 {'name': 'BEA Systems',
  'acquisition': {'price_amount': 8500000000.0,
   'price_currency_code': 'USD',
   'term_code': None,
   'source_url': 'http://www.oracle.com/corporate/press/2008_jan/bea.html',
   'source_description': 'Oracle to Acquire BEA Systems',
   'acquired_year': 2008,
   'acquired_month': 1,
   'acquired_day': 16,
   'acquiring_company': {'name': 'Oracle Corporation',
    'permalink': 'oracle'}}},
 {'name': 'Pixar',
  'acquisition': {'price_amount': 7400000000.0,
   'price_currency_code': 'USD',
   'term_code': 'stock',
   'source_url': 'http://www.pixar.com/companyinfo/about_us/overview.htm',
   'source_description': 'Pixar About Page',
   'acquired_year': 2006,
   'acquired_month': 1,
   'acquired_day': 24,
   'acquiring_company': {'name': 'The Walt Disney Company',
    'permalink': 'the-walt-disney-company'}}},
 {'name': 'Puget Energy',
  'acquisition': {'price_amount': 7400000000.0,
   'price_currency_code': 'USD',
   'term_code': 'cash',
   'source_url': 'http://www.xconomy.com/seattle/2009/02/09/puget-energy-goes-private-for-74b/',
   'source_description': 'xconomy',
   'acquired_year': 2009,
   'acquired_month': 2,
   'acquired_day': 9,
   'acquiring_company': {'name': 'Puget Holdings',
    'permalink': 'puget-holdings'}}},
 {'name': 'Siebel Systems',
  'acquisition': {'price_amount': 5850000000.0,
   'price_currency_code': 'USD',
   'term_code': 'stock',
   'source_url': 'http://www.oracle.com/corporate/press/2006_jan/sieb_cl.html',
   'source_description': 'Oracle Agrees to Buy Siebel for $10.66 a Share  ',
   'acquired_year': 2006,
   'acquired_month': 1,
   'acquired_day': 31,
   'acquiring_company': {'name': 'Oracle Corporation',
    'permalink': 'oracle'}}},
 {'name': 'Sterling Commerce',
  'acquisition': {'price_amount': 3900000000.0,
   'price_currency_code': 'USD',
   'term_code': None,
   'source_url': 'http://news.cnet.com/2100-1033-237171.html',
   'source_description': 'SBC e-commerce buy signals new ambitions',
   'acquired_year': 2009,
   'acquired_month': 2,
   'acquired_day': 22,
   'acquiring_company': {'name': 'AT&T', 'permalink': 'at-t'}}},
 {'name': 'SuccessFactors',
  'acquisition': {'price_amount': 3400000000.0,
   'price_currency_code': 'USD',
   'term_code': None,
   'source_url': 'http://techcrunch.com/2012/02/22/successfactors-sap/',
   'source_description': 'After Closing $3.4B Acquisition Of SuccessFactors, SAP Pushes Human Capital Management In The Cloud',
   'acquired_year': 2012,
   'acquired_month': 2,
   'acquired_day': 22,
   'acquiring_company': {'name': 'SAP', 'permalink': 'sap'}}},
 {'name': 'WebEx',
  'acquisition': {'price_amount': 2900000000.0,
   'price_currency_code': 'USD',
   'term_code': 'cash',
   'source_url': 'http://blog.tmcnet.com/blog/tom-keating/voip/cisco-acquires-webex.asp',
   'source_description': 'Cisco acquires WebEx',
   'acquired_year': 2007,
   'acquired_month': 3,
   'acquired_day': 15,
   'acquiring_company': {'name': 'Cisco', 'permalink': 'cisco'}}},
 {'name': 'WebEx',
  'acquisition': {'price_amount': 2900000000.0,
   'price_currency_code': 'USD',
   'term_code': 'cash',
   'source_url': 'http://blog.tmcnet.com/blog/tom-keating/voip/cisco-acquires-webex.asp',
   'source_description': 'Cisco acquires WebEx',
   'acquired_year': 2007,
   'acquired_month': 3,
   'acquired_day': 15,
   'acquiring_company': {'name': 'Cisco', 'permalink': 'cisco'}}},
 {'name': 'GeoCities',
  'acquisition': {'price_amount': 2870000000.0,
   'price_currency_code': 'USD',
   'term_code': 'cash',
   'source_url': 'http://news.cnet.com/Yahoo-completes-GeoCities-acquisition/2100-1023_3-226485.html',
   'source_description': 'Yahoo completes GeoCities acquisition',
   'acquired_year': 1999,
   'acquired_month': 1,
   'acquired_day': 28,
   'acquiring_company': {'name': 'Yahoo!', 'permalink': 'yahoo'}}}]

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [106]:
filter_12 = {"founded_year":{"$gte":2000, "$lte":2010},"acquisition.acquired_year":{"$lt":2011}}
projection = {"name": 1,"_id":0,"founded_year":1, "acquisition.acquired_year":1} 
results = list(c.find(filter_12, projection).sort("founded_year",-1))
pd.DataFrame(results)

                 name  founded_year              acquisition
0              Vusion          2009  {'acquired_year': 2009}
1             Digimix          2009  {'acquired_year': 2009}
2           About Me!          2009  {'acquired_year': 2007}
3           Divvyshot          2009  {'acquired_year': 2010}
4           Cloudkick          2009  {'acquired_year': 2010}
..                ...           ...                      ...
708  Skywire Software          2000  {'acquired_year': 2008}
709  Sirific Wireless          2000  {'acquired_year': 2009}
710      LogicLibrary          2000  {'acquired_year': 2008}
711    EnterSys Group          2000  {'acquired_year': 2009}
712         EnteGreat          2000  {'acquired_year': 2008}

[713 rows x 3 columns]

### 20. All the companies that have been 'deadpooled' after the third year.

In [128]:
filter_12 = {}
projection = {"founded_year": 1,"_id":0,"deadpooled_year":1, "name":1} 
results = list(c.find(filter_12, projection).sort("name",1))
pd.DataFrame(results)

years_after_third_year = "deadpooled_year" - 3

filter_1 = {"founded_year": {"$gte": years_after_third_year}}
projection = {"name": 1, "_id": 0} 

results = list(c.find(filter_1, projection).sort("founded_year", -1))

NameError: name 'deadpooled_year' is not defined

**⚠️ Did you do this?**

```python
list(collection.find(query))[:5] #or a reasonably low number
```